;ability points
[MOCXEvac X2AbilityPointTemplate]
ActionFriendlyName="by a MOCX unit evacuating"

[MOCXKill X2AbilityPointTemplate]
ActionFriendlyName="by killing a MOCX unit"

;SITREPs

[MOCX X2SitRepTemplate]
FriendlyName="MOCX Squad"
Description="A squad from the MOCX Initiative has been deployed here."

[MOCXRookies X2SitRepTemplate]
FriendlyName="MOCX Training Exercise"
Description="The MOCX Initiative is running a large scale exercise here: all troops initially encountered will be MOCX rookies."

[MOCXRookiesEffect X2SitRepEffect_ModifyDefaultEncounterLists]
FFriendlyName="MOCX Training Exercise"
Description="The MOCX Initiative is running a large scale exercise here: all troops initially encountered will be MOCX rookies."

[FullMOCXEffect X2SitRepEffectTemplate]
FriendlyName="MOCX Squad"
Description="A squad from the MOCX Initiative has been deployed here. MOCX has access to jamming tecnhologies, so the shadow chamber won't show them."



;weapons and items

[Dark_Shotgun_MG X2WeaponTemplate]
FriendlyName="ADVENT Shardgun"
FriendlyNamePlural="ADVENT Shardguns"
BriefSummary="Weaker compared to our own magnetic shotguns, we may still have use of this if it's ahead of our own techbase, or for supplies from the black market."
TacticalText="<Bullet/> Magnetized weapon technology makes for an especially effective improvement of XCOM's combat shotgun.\n<Bullet/> Shotgun-style weapons are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Use upgrades looted from enemies to improve the Shard Gun's tactical effectiveness."
AbilityDescName="shotgun"

[Dark_Shotgun_CG X2WeaponTemplate]
FriendlyName="ADVENT Scatterguns"
FriendlyNamePlural="ADVENT Scatterguns"
BriefSummary="A coil-tech based weapon, this shotgun has the unique ability to ignore some armour. May be useful for our own purposes."
TacticalText="<Bullet/> Coil weapons automatically pierce (ignore) 1 enemy armor.<br/><Bullet/> Shotgun-style weapons are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Use upgrades looted from enemies to improve the Scattergun's tactical effectiveness."
AbilityDescName="shotgun"

[Dark_Shotgun_BM X2WeaponTemplate]
FriendlyName="ADVENT Storm Guns"
FriendlyNamePlural="ADVENT Storm Guns"
BriefSummary="A plasma-based shotgun, its power may be lower than what we could make ourselves, but it still packs a punch regardless."
TacticalText="<Bullet/> This is the most advanced shotgun-style weapon available in the XCOM arsenal.\n<Bullet/> Shotgun-style weapons are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Use upgrades looted from enemies to improve the Storm Gun's tactical effectiveness."
AbilityDescName="shotgun"



[Dark_SMG_MG X2WeaponTemplate]
FriendlyName="ADVENT Scattermags"
FriendlyNamePlural="ADVENT Scattermags"
BriefSummary="A weaker counterpart to our own SMGs, we may still be able to use this if needed. Or sell it on the black market for some cash, at least."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades recovered from ADVENT enemies to improve the Stuttermag's tactical effectiveness. \n<Bullet/> SMG-style weapons offer bonus mobility, close-quarters accuracy and concealment relative to assault rifles, but they do less damage, have less ammo, and suffer accuracy penalties at long range."
AbilityDescName="SMG"

[Dark_SMG_CG X2WeaponTemplate]
FriendlyName="ADVENT Subcoiler"
FriendlyNamePlural="ADVENT Subcoilers"
BriefSummary="A coil-tech based weapon, this shotgun has the unique ability to ignore some armour. May be useful for our own purposes."
TacticalText="<Bullet/> Coil weapons automatically pierce (ignore) 1 enemy armor.<br/><Bullet/> SMG-style weapons offer bonus mobility, close-quarters accuracy and concealment relative to assault rifles, but they do less damage, have less ammo, and suffer accuracy penalties at long range.<br/>"
AbilityDescName="SMG"

[Dark_SMG_BM X2WeaponTemplate]
FriendlyName="ADVENT Scramgun"
FriendlyNamePlural="ADVENT Scramguns"
BriefSummary="A plasma-based submachine gun, it may do less damage than our own plasma SMG blueprints, but it still packs a punch regardless."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> Use upgrades recovered from ADVENT enemies to improve the Scramgun's tactical effectiveness. \n<Bullet/> SMG-style weapons offer bonus mobility, close-quarters accuracy and concealment relative to assault rifles, but they do less damage, have less ammo, and suffer accuracy penalties at long range."
AbilityDescName="SMG"



[Dark_Cannon_MG X2WeaponTemplate]
FriendlyName="ADVENT Mag Cannon"
FriendlyNamePlural="ADVENT Mag Cannon"
BriefSummary="Weaker than our own magnetic weapons, these recovered weapons may nonetheless prove useful for our soldiers, or even just our supply flow."
TacticalText="<Bullet/> The Mag Cannon is a much more powerful, yet equally deployable, version of the conventional Cannon.\n<Bullet/> Use upgrades looted from enemies to improve the Mag Cannon's tactical effectiveness."
AbilityDescName="cannon"

[Dark_Cannon_CG X2WeaponTemplate]
FriendlyName="ADVENT Gauss Cannon"
FriendlyNamePlural="ADVENT Gauss Cannons"
BriefSummary="A coil-tech based weapon, this shotgun has the unique ability to ignore some armour. May be useful for our own purposes."
TacticalText="<Bullet/> Coil weapons automatically pierce (ignore) 1 enemy armor.<br/><Bullet/> The cannon serves in a squad automatic weapon role, has more ammo and does more damage than its rifle counterpart, but it is cumbersome to carry.<br/><Bullet/> Use upgrades recovered from ADVENT enemies to improve the Gauss Cannon's tactical effectiveness.<br/>"
AbilityDescName="cannon"

[Dark_Cannon_BM X2WeaponTemplate]
FriendlyName="ADVENT Beam Cannon"
FriendlyNamePlural="ADVENT Beam Cannons"
BriefSummary="A plasma-based cannon, it may do less damage than our own plasma cannon blueprints, but it still packs a punch regardless."
TacticalText="<Bullet/> The Beam Cannon is the most powerful combat support weapon human forces can deploy.\n<Bullet/> Use upgrades looted from enemies to improve the Beam Cannon's tactical effectiveness."
AbilityDescName="cannon"



[Dark_AssaultRifle_MG X2WeaponTemplate]
FriendlyName="ADVENT Mag Rifle"
FriendlyNamePlural="ADVENT Mag Rifles"
BriefSummary="Weaker than our own magnetic weapons, these recovered weapons may nonetheless prove useful for our soldiers, or even just our supply flow."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Magnetic Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

[Dark_AssaultRifle_CG X2WeaponTemplate]
FriendlyName="ADVENT Coil Rifle"
FriendlyNamePlural="ADVENT Coil Rifles"
BriefSummary="A coil-tech based weapon, this shotgun has the unique ability to ignore some armour. May be useful for our own purposes."
TacticalText="<Bullet/> Coil weapons automatically pierce (ignore) 1 enemy armor.<br/><Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades recovered from ADVENT enemies to improve the Coil Rifles's tactical effectiveness.<br/>"
AbilityDescName="assault rifle"

[Dark_AssaultRifle_BM X2WeaponTemplate]
FriendlyName="ADVENT Plasma Rifle"
FriendlyNamePlural="ADVENT Plasma Rifles"
BriefSummary="A plasma-based rifle, it may do less damage than our own plasma rifle blueprints, but it still packs a punch regardless."
TacticalText="<Bullet/> The Plasma Rifle is a general purpose, supremely powerful primary infantry weapons system.\n<Bullet/> Firing the primary weapon always ends the soldier's turn.\n<Bullet/> Use upgrades looted from enemies to improve the Plasma Rifle's tactical effectiveness."
AbilityDescName="assault rifle"





[Dark_SniperRifle_MG X2WeaponTemplate]
FriendlyName="ADVENT Long Rifle"
FriendlyNamePlural="ADVENT Long Rifles"
BriefSummary="Weaker than our own magnetic weapons, these recovered weapons may nonetheless prove useful for our soldiers, or even just our supply flow."
TacticalText="<Bullet/> Sniper rifles typically require both actions to fire.\n<Bullet/> They are less accurate at close range, but deadly at a distance.\n<Bullet/> Use upgrades looted from enemies to improve the Mag Long Rifle's tactical effectiveness."
AbilityDescName="sniper rifle"

[Dark_SniperRifle_CG X2WeaponTemplate]
FriendlyName="ADVENT Gauss Rifle"
FriendlyNamePlural="ADVENT Gauss Rifles"
BriefSummary="A coil-tech based weapon, this shotgun has the unique ability to ignore some armour. May be useful for our own purposes."
TacticalText="<Bullet/> Coil weapons automatically pierce (ignore) 1 enemy armor.<br/><Bullet/> Sniper rifles typically require both actions to fire without special training.\n<Bullet/> They are less accurate at close range, but deadly at a distance.\n<Bullet/> Use upgrades looted from enemies to improve the Gauss Long Rifle's tactical effectiveness."
AbilityDescName="sniper rifle"

[Dark_SniperRifle_BM X2WeaponTemplate]
FriendlyName="ADVENT Plasma Lance"
FriendlyNamePlural="ADVENT Plasma Lances"
BriefSummary="A plasma-based sniper rifle, it may do less damage than our own plasma sniper rifle blueprints, but it still packs a punch regardless."
TacticalText="<Bullet/> This is the apex of sniper rifle technology.\n<Bullet/> Sniper rifles always require both actions to fire.\n<Bullet/> They are less accurate at close range, but deadly at a distance.\n<Bullet/> Use upgrades looted from enemies to improve the plasma sniper rifle's tactical effectiveness."
AbilityDescName="sniper rifle"


[WeaponFragment X2ItemTemplate]
FriendlyName="Weapon Fragment"
FriendlyNamePlural="Weapon Fragments"
BriefSummary="The remains of a destroyed enemy weapon. We can salvage what we can and sell it at the black market."
LootTooltip="This is what's left of certain enemies weapons at times. This isn't used for anything valuable."


;character names
[AdvMec_MOCX X2CharacterTemplate]
strCharacterName="MOCX MEC"

[DarkSoldier X2CharacterTemplate]
strCharacterName="MOCX Soldier"

[DarkRookie X2CharacterTemplate]
strCharacterName="MOCX Rookie"

[DarkRookie_M2 X2CharacterTemplate]
strCharacterName="MOCX Grunt"

[DarkRookie_M3 X2CharacterTemplate]
strCharacterName="MOCX Trooper"

[DarkGrenadier X2CharacterTemplate]
strCharacterName="MOCX Grenadier"

[DarkSpecialist X2CharacterTemplate]
strCharacterName="MOCX Specialist"

[DarkRanger X2CharacterTemplate]
strCharacterName="MOCX Ranger"

[DarkSniper X2CharacterTemplate]
strCharacterName="MOCX Sniper"

[DarkPsiAgent X2CharacterTemplate]
strCharacterName="MOCX Psi Agent"


[DarkGrenadier_M2 X2CharacterTemplate]
strCharacterName="Advanced MOCX Grenadier"

[DarkSpecialist_M2 X2CharacterTemplate]
strCharacterName="Advanced MOCX Specialist"

[DarkRanger_M2 X2CharacterTemplate]
strCharacterName="Advanced MOCX Ranger"

[DarkSniper_M2 X2CharacterTemplate]
strCharacterName="Advanced MOCX Sniper"

[DarkPsiAgent_M2 X2CharacterTemplate]
strCharacterName="Advanced MOCX Psi Agent"


[DarkGrenadier_M3 X2CharacterTemplate]
strCharacterName="Elite MOCX Grenadier"

[DarkSpecialist_M3 X2CharacterTemplate]
strCharacterName="Elite MOCX Specialist"

[DarkRanger_M3 X2CharacterTemplate]
strCharacterName="Elite MOCX Ranger"

[DarkSniper_M3 X2CharacterTemplate]
strCharacterName="Elite MOCX Sniper"

[DarkPsiAgent_M3 X2CharacterTemplate]
strCharacterName="Elite MOCX Psi Agent"


;Techs

[RM_BasicPCS X2TechTemplate]
DisplayName="Build Basic PCS"
Summary="Using the combat chips developed for the MOCX Initiative, we should be able to repurpose them into personal combat sims XCOM soldiers can use. These will include basic PCSes, including Combat Awareness and Hyper-reactive Pupils."

[RM_AdvPCS X2TechTemplate]
DisplayName="Build Advanced PCS"
Summary="Using the combat chips developed for the MOCX Initiative, we should be able to repurpose them into personal combat sims XCOM soldiers can use. These will include more advanced PCSes, like Smart Macrophages or Long Jump."

[RM_SupPCS X2TechTemplate]
DisplayName="Build Superior PCS"
Summary="Using the combat chips developed for the MOCX Initiative, we should be able to repurpose them into personal combat sims XCOM soldiers can use. These will include the ultimate PCSes we can make, like Combat Rush or Mimetic Skin."

[RM_ProduceChip X2TechTemplate]
DisplayName="Build Combat Chip"
Summary="Part of the gains we've had from the exodus of MOCX engineering and research crew is the blueprints to MOCX's combat chips. This should enable us to manufacture PCSes for the known future."


[RM_DecryptChip X2TechTemplate]
DisplayName="MOCX Chip Decryption"
Summary="The MOCX Initiative has outfitted their soldiers with a new advanced chip system I remember only being theorized about when I left ADVENT. This certainly explains why we've had issue hacking into their comms compared to the rest of ADVENT. We may gain much if we look into what advancements they've made."
CodeName="Persona"
LongDescription="The combat chip system MOCX personnel uses is certainly a surprise improvement ADVENT has made for their elite soldiers. Perhaps our actions beforehand had made them decide to rush R&D on this. However, now that we've had a close look as to how it works, I should be able to adapt our intelligence gathering to work with MOCX's encryption methods. In addition, I believe Shen can make use of these chips to make personal combat sims our own troops can use. I'm sure she'll have proposals already ready for you, Commander. R. Tygan."
AlertString="MOCX Combat Chip"


;Dark Events
[DarkEvent_CoilTier X2DarkEventTemplate]
DisplayName="MOCX Research: Coilguns"
SummaryText="MOCX deploys advanced coil-based technology for their soldiers."
QuoteText="\"Wait a minute...how do they have my designs?!\""
QuoteTextAuthor="- Chief Shen"
PreMissionText="Grants MOCX soldiers more advanced equipment"
PostMissionSuccessText="Dark Event Countered: MOCX Coilguns"
PostMissionFailureText="Failed to Counter Dark Event: MOCX Coilguns"

[DarkEvent_PlasmaTier X2DarkEventTemplate]
DisplayName="MOCX Research: Plasma Weaponry"
SummaryText="MOCX deploys plasma-based technology for their soldiers."
QuoteText="\"Looks like the aliens are finally willing to give the lackeys their strongest tech.\""
QuoteTextAuthor="- Central Officer Bradford"
PreMissionText="Grants MOCX soldiers top of the line equipment"
PostMissionSuccessText="Dark Event Countered: MOCX Plasma Weaponry"
PostMissionFailureText="Failed to Counter Dark Event: MOCX Plasma Weaponry"

[DarkEvent_SquadSizeI X2DarkEventTemplate]
DisplayName="MOCX Research: Squad Size I"
SummaryText="MOCX upgrades the carrying capacity of their transports, giving them one additional soldier on missions."
QuoteText="\"Wait, wasn't that our thing in the last war?\""
QuoteTextAuthor="- Central Officer Bradford"
PreMissionText="Increases MOCX squad size by one."
PostMissionSuccessText="Dark Event Countered: MOCX Squad Size I"
PostMissionFailureText="Failed to Counter Dark Event: MOCX Squad Size I"

[DarkEvent_SquadSizeII X2DarkEventTemplate]
DisplayName="MOCX Research: Squad Size II"
SummaryText="MOCX upgrades the carrying capacity of their transports again, giving them one more soldier on missions."
QuoteText="\"No seriously this was our thing, wasn't it?\""
QuoteTextAuthor="- Central Officer Bradford"
PreMissionText="Increases MOCX squad size by one. Again."
PostMissionSuccessText="Dark Event Countered: MOCX Squad Size II"
PostMissionFailureText="Failed to Counter Dark Event: MOCX Squad Size II"

[DarkEvent_ICU X2DarkEventTemplate]
DisplayName="MOCX Research: Intensive Care Units"
SummaryText="ADVENT builds emergency care centers for MOCX, enabling MOCX soldiers to get back in the fight faster."
QuoteText="\"Not impressed! We can do that too!\""
QuoteTextAuthor="- Sgt. Vegeta"
PreMissionText="MOCX soldiers recover faster from wounds incurred on the battlefield."
PostMissionSuccessText="Dark Event Countered: MOCX ICUs"
PostMissionFailureText="Failed to Counter Dark Event: MOCX ICUs"

[DarkEvent_AdvancedMECs X2DarkEventTemplate]
DisplayName="MOCX Research: Advanced MEC Support"
SummaryText="MOCX custom-builds SPARK-type MECs for support in the field, requisitioning these MECs to their squads in the field."
QuoteText="\"Looks like ADVENT finally salvaged my old place...\""
QuoteTextAuthor="- Julian"
PreMissionText="MOCX can now deploy MECs alongside squads in the field."
PostMissionSuccessText="Dark Event Countered: MOCX MECs"
PostMissionFailureText="Failed to Counter Dark Event: MOCX MECs"

[DarkEvent_GeneticPCS X2DarkEventTemplate]
DisplayName="MOCX Research: Genetic Combat Chips"
SummaryText="MOCX advances their combat chip technology even further, enabling more radical options for their soldiers."
QuoteText="\"I just love using acid on a MOCX guy that turns out to be immune to that sort of thing.\""
QuoteTextAuthor="- Cpl. R. Edditor."
PreMissionText="MOCX soldiers can now get more advanced combat chips for use in the field."
PostMissionSuccessText="Dark Event Countered: MOCX Combat Chips"
PostMissionFailureText="Failed to Counter Dark Event: MOCX Combat Chips"


;MISSIONS
[MOCXFirst X2MissionFlavorTextTemplate]
FlavorText="MISSING FLAVOR TEXT"
CouncilSpokesmanSuccessText="Your capture of the alien facility in <XGParam:StrValue0/!WorldRegionName/> has given us major leads on the Avatar Project, Commander. Your actions today will leave no question as to humanity's resolve in recapturing control of Earth." 
CouncilSpokesmanFailureText="Commander, your failed capture attempt at the alien facility in <XGParam:StrValue0/!WorldRegionName/> has tipped our hand to the aliens, and their MOCX Initiative. I still have faith in your abilities, but we'll have to do better, Commander."

[MOCXSecond X2MissionFlavorTextTemplate]
FlavorText="MISSING FLAVOR TEXT"
CouncilSpokesmanSuccessText="The retrieval of key documents vital to the MOCX Initiative is a great blow to them, Commander. Hopefully, this signifies that the end of ADVENT's project is near." 
CouncilSpokesmanFailureText="Commander, your failed capture attempt of vital alien documents in <XGParam:StrValue0/!WorldRegionName/> has tipped our hand to them. We must do better next time."

[MOCXThird X2MissionFlavorTextTemplate]
FlavorText="MISSING FLAVOR TEXT"
CouncilSpokesmanSuccessText="The retrieval of key documents vital to the MOCX Initiative is a great blow to them, Commander. Hopefully, this signifies that the end of ADVENT's project is near." 
CouncilSpokesmanFailureText="Commander, your failed capture attempt of vital alien documents in <XGParam:StrValue0/!WorldRegionName/> has tipped our hand to them. We must do better next time."

[MissionSource_MOCXOffsite X2MissionSourceTemplate]
BattleOpName="Operation Dark Secrets"
MissionPinLabel="Offsite Avatar Facility"
MissionFlavorText="This remote alien facility is heavily guarded by ADVENT, and an attached MOCX squad. At the same time, this represents the best opportunity to capture alien materiel."

[MissionSource_MOCXTraining X2MissionSourceTemplate]
BattleOpName="Operation Shadow Blade"
MissionPinLabel="Raid Training Exercise"
MissionFlavorText="A large scale training exercise is not normally a place we would want to go to. The intel we've gathered however, indicates key documents vital to any future efforts against MOCX will be stored there for the time being."

[MissionSource_MOCXAssault X2MissionSourceTemplate]
BattleOpName="Operation Broken Mirror"
MissionPinLabel="Sabotage MOCX HQ"
MissionFlavorText="We now have our best chance at taking down the MOCX Initiative: let's end this mockery of XCOM once and for all."



[Dark_OffsiteStorage X2MissionTemplate]
DisplayName="Offsite Backup Facility Attack"
Briefing="Secure Avatar Project Backups Facility"
PostMissionType="Secure enemy facility"
BriefingImage="img:///UILibrary_StrategyImages.X2StrategyMap.Alert_Advent_Facility"
ObjectiveTextPools[0]="Neutralize all enemy targets"

[Dark_OffsiteStorage X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all enemy targets guarding the facility"
ObjectiveTextPools[1]="Secure enemy facility"
ObjectiveTextPools[2]="Extract all XCOM soldiers"


[Dark_TrainingRaid X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all enemy targets if possible"
ObjectiveTextPools[1]="Download %QUESTITEM% from exposed access point"
ObjectiveTextPools[2]="Extract all XCOM soldiers"

[Dark_TrainingRaid X2MissionTemplate]
DisplayName="Training Exercise Raid"
Briefing="Hack the marked Computer in the AO"
PostMissionType="Hack Workstation"
BriefingImage="img:///UILibrary_StrategyImages.X2StrategyMap.Alert_Advent_Facility"
ObjectiveTextPools[0]="Hack the computer uplinked to MOCX's network"
ObjectiveTextPools[1]="Evac if required: mission will be considered a success if blueprints are retrieved"

[Dark_RooftopsAssault X2MissionTemplate]
DisplayName="Sabotage MOCX HQ"
Briefing="Sabotage MOCX HQ"
PostMissionType="Sabotage MOCX HQ"
BriefingImage="img:///UILibrary_StrategyImages.X2StrategyMap.Alert_Sky_Tower"
ObjectiveTextPools[0]="Place X4 charges in the designated room"
ObjectiveTextPools[1]="Escape the Area of Operations"

[Dark_RooftopsAssault X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Plant X4 to Destroy MOCX HQ"
ObjectiveTextPools[1]="Extract all XCOM soldiers"
ObjectiveTextPools[2]="Call in the skyranger and extract all soldiers to complete this mission."


[RM_HQBluePrint X2QuestItemTemplate]
FriendlyName="MOCX HQ Blueprints"
FriendlyNamePlural="MOCX HQ Blueprints"
LootTooltip="Detailed blueprints of MOCX HQ, taken from their networks."

;;;;;;;;;;;;;;;;;;;;  TACTICAL LOC ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;PCSes and Abilities

[LongJumpPCS X2EquipmentTemplate]
FriendlyName="PCS: Long Jump"
FriendlyNamePlural="PCS: Long Jump"
BriefSummary="This genetic implant enables a soldier to jump higher than buildings, enabling them to seamlessly travel to rooftops and the ground below."

[MimeticSkinPCS X2EquipmentTemplate]
FriendlyName="PCS: Mimetic Skin"
FriendlyNamePlural="PCS: Mimetic Skin"
BriefSummary="This genetic implant enables a soldier to blend in with their surroundings when no hostiles are around to peak their adrenaline, enabling them to re-conceal when they're in full cover."


[RM_ControlChip X2ItemTemplate]
FriendlyName="MOCX Personal Combat Chip"
FriendlyNamePlural="MOCX Personal Combat Chips"
BriefSummary="What we retained from the otherwise human corpses of MOCX personnel: their implants could be of use to XCOM."

[RM_DarkEvac X2AbilityTemplate]
LocFriendlyName="Evac!"
LocLongDescription="Evacuate from the battlefield."
LocHelpText="Evacuate from the battlefield."
LocFlyOverText="Calling For Evac"

[RM_EvacTeleport X2AbilityTemplate]
LocFriendlyName="Evac!"
LocLongDescription="Evacuate from the battlefield."
LocHelpText="Evacuate from the battlefield."
LocFlyOverText="Evacuated!"

[RM_FakeBleedout X2AbilityTemplate]
LocFriendlyName="Spec Ops Durability"
LocLongDescription="Have a chance of simply being stunned for the rest of the mission instead of being killed."
LocHelpText="Have a chance of simply being stunned for the rest of the mission instead of being killed."
LocFlyOverText="Bleeding Out!"

[RM_FakeBleedoutTriggered X2AbilityTemplate]
LocFriendlyName="Spec Ops Durability"
LocLongDescription="Have a chance of simply being stunned for the rest of the mission instead of being killed."
LocHelpText="Have a chance of simply being stunned for the rest of the mission instead of being killed."
LocFlyOverText="Bleeding Out!"

[RM_LongJump X2AbilityTemplate]
LocFriendlyName="Long Jump"
LocFlyOverText="Long Jump"
LocLongDescription="Seamlessly travel to rooftops without needing ladders, poles, etc."
LocHelpText="Seamlessly travel to rooftops without needing ladders, poles, etc."
LocPromotionPopupText="<Bullet/> Seamlessly travel to rooftops without needing ladders, poles, etc.<br/>"

[RM_MimeticSkin X2AbilityTemplate]
LocFriendlyName="Mimetic Skin"
LocFlyOverText="Mimetic Skin"
LocLongDescription="Re-conceal when moving to full cover with no enemies around."
LocHelpText="Re-conceal when moving to full cover with no enemies around."
LocPromotionPopupText="<Bullet/> Re-conceal when moving to full cover with no enemies around.<br/>"

[RM_Intimidate X2AbilityTemplate]
LocFriendlyName="Intimidate"
LocLongDescription="When targeted by an attack, the enemy has a chance to panic."
LocHelpText="When targeted by an attack, the enemy has a chance to panic."
LocFlyOverText="Intimidate"
LocPromotionPopupText="<Bullet/> Intimidate's chance to panic the attacker increases with higher tier SPARK armors.<br/><Bullet/> Intimidate can be triggered by melee and area of effect attacks.<br/><Bullet/> Intimidate will not trigger when targeted by Overwatch fire.<br/>"

[RM_IntimidateTrigger X2AbilityTemplate]
LocFriendlyName="Intimidate"
LocLongDescription="When targeted by an attack, all visible enemies have a chance to panic."
LocHelpText="When targeted by an attack, all visible enemies have a chance to panic."
LocFlyOverText="Intimidate"
LocPromotionPopupText=""
LocMissMessage="Intimidate Failed"


[Reward_MOCXOffsite X2RewardTemplate]
DisplayName="Recon Offsite Faciilty"
RewardDetails="Unlock a mission to raid an offsite facility related to the Avatar Project"

[Reward_MOCXTraining X2RewardTemplate]
DisplayName="Recon Training Exercise"
RewardDetails="Unlock a mission to steal important documents from a training exercise"

[Reward_MOCXAssault X2RewardTemplate]
DisplayName="Recon MOCX HQ"
RewardDetails="Unlock the mission to stop the MOCX Initiative once and for all."

[CovertAction_MOCXAssault X2CovertActionTemplate]
ActionObjective="Recon MOCX HQ"

[CovertAction_MOCXTraining X2CovertActionTemplate]
ActionObjective="Recon Training Exercise"

[CovertAction_MOCXOffsite X2CovertActionTemplate]
ActionObjective="Recon Offsite Facility"


[CovertActionNarrative_MOCXOffsite X2CovertActionNarrativeTemplate]
ActionName="Recon Offsite Facility"
ActionPreNarrative="This \"MOCX\" initiative is becoming a problem for the Resistance, and we're going need to work with the factions to take them down. One of them has learned the location of an Avatar Project related facility a MOCX squad is doing guard detail for, and want our help in performing recon on it."
ActionPostNarrative="We have learned a great deal about this facility: now we have our chance to take it over for ourselves."

[CovertActionNarrative_MOCXTrainingX2CovertActionNarrativeTemplate]
ActionName="Recon Training Exercise"
ActionPreNarrative="With our recent victories against MOCX, we must continue to press our attack on them. With them conducting a large scale urban warfare exercise, it is likely they will retain local copies of valuable intel we need to get."
ActionPostNarrative="The faction we've worked with has confirmed the presence of valuable intel: we should grab it while we still can."

[CovertActionNarrative_MOCXAssault X2CovertActionNarrativeTemplate]
ActionName="Prepare Attack on MOCX HQ"
ActionPreNarrative="The blueprints we've recovered has provided us with the keys to MOCX's home base: now we need to make sure the airspace will be clear for Firebrand's arrival. After that, X4 in the right place should end this Initiatve once and for all."
ActionPostNarrative="The faction we've worked with is giving the all-clear on any attempt at aerial infilitration, all we need is for you to give the go-ahead on the mission, Commander."

[RM_Vanish X2AbilityTemplate]
LocFriendlyName="Vanishing"
LocLongDescription="Soldier becomes concealed from enemies."
LocHelpText="Soldier becomes concealed from enemies."
LocFlyOverText="Concealed!"

[RM_VanishPhantom X2AbilityTemplate]
LocFriendlyName="Phantom"
LocLongDescription="This soldier starts concealed at the start of missions"
LocHelpText="This soldier starts concealed at the start of missions"
LocFlyOverText="Phantom"


[RM_VanishReveal X2AbilityTemplate]
LocFriendlyName="Reveal"
LocFlyOverText="Revealed!"
LocHelpText="Reveal this unit to the enemy.  This happens automatically if actions are performed while vanished."
LocLongDescription="Reveal this unit to the enemy.  This happens automatically if actions are performed while vanished."


[ResAct_MOCXMissionCompleted X2ResistanceActivityTemplate]
DisplayName="Anti-MOCX Ops Completed:"

[ResAct_MOCXMissionFailed X2ResistanceActivityTemplate]
DisplayName="Anti-MOCX Ops Failed:"


[FearOfMOCX X2TraitTemplate]
TraitFriendlyName ="Fear of MOCX"
TraitScientificName="Anthrophobia"
TraitDescription ="Chance to panic when encountering a MOCX soldier."
TraitQuotes[0]="\"I signed up to kill aliens, not humans.\""
TraitQuotes[1]="\"They can find us, it doesn't matter where we run.\""
TraitQuotes[2]="\"It's like they know exactly how we operate.\""
TraitQuotes[3]="\"I didn't want red blood on my hands.\""
TraitQuotes[4]="\"How much more can we take?!\""

[FearOfMOCXPassive X2AbilityTemplate]
LocFriendlyName="Fear of MOCX"
LocLongDescription="This unit may panic when MOCX is encountered in combat."
